nc: 80
scales: 
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]
  
  - [-1, 1, FCM_3, []]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, FCM_2, []]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, FCM_1, []]
  - [-1, 1, MSDKBlock, []]
  - [-1, 1, FCM, []]

head:
  - [10, 1, Conv, [128, 1, 1, None, 1, 1, False]]
  - [-1, 1, EfficientAdditiveAttnetionBlock, [1024]]

  - [6, 1, Conv, [128, 1, 1]]
  - [4, 1, Conv, [128, 1, 1]]

  # TFDFPN
  - [[12, 13, 14], 1, TSFA, [[5, 7, 9, 11], 0.5]]
  - [-1, 1, Conv, [128, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 14], 1, Fusion, []]
  - [-1, 3, RepC3, [128, 0.5]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13, 16], 1, Fusion, []]
  - [-1, 3, RepC3, [128, 0.5]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Fusion, []]
  - [-1, 3, RepC3, [128, 0.5]]

  - [[22, 25], 1, RTDETRDecoder, [nc, 128, 300, 4, 8, 3]] 